{"name": "Reidane, God of the Worthy // Valkmira, Protector's Shield", "manaCost": "{2}{W}", "cmc": 3.0, "colors": ["White"], "colorIdentity": ["W"], "type": "Legendary Creature — God", "supertypes": ["Legendary"], "types": ["Creature"], "subtypes": ["God"], "rarity": "Rare", "set": "KHM", "setName": "Kaldheim", "text": "Flying, vigilance\nSnow lands your opponents control enter the battlefield tapped.\nNoncreature spells your opponents cast with mana value 4 or greater cost {2} more to cast.", "artist": "Jason Rainville", "number": "21", "power": "2", "toughness": "3", "layout": "modal_dfc", "multiverseid": "503626", "imageUrl": "http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=503626&type=card", "variations": ["40fe6ac7-6154-5d84-8431-394c4d6ca155"], "rulings": [{"date": "2021-02-05", "text": "Valkmira’s first ability prevents 1 damage from each source an opponent controls each time that source would deal damage to you. It prevents 1 of any kind of damage, not just combat damage."}, {"date": "2021-02-05", "text": "Valkmira’s last ability affects each spell (including Aura spells), activated ability, and triggered ability controlled by an opponent that targets you or another permanent you control."}, {"date": "2021-02-05", "text": "There is a single triangle icon in the top left corner of the front face. There is a double triangle icon in the top left corner of the back face."}, {"date": "2021-02-05", "text": "To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying, add any cost increases (such as that of Reidane, God of the Worthy), then apply any cost reductions. The converted mana cost of the spell is determined only by its mana cost, no matter what the total cost to cast the spell was."}, {"date": "2021-02-05", "text": "If a spell has {X} in its mana cost, use the value of X to determine whether its converted mana cost is 4 or greater. If it is, Reidane’s last ability will apply. If not, it won’t."}, {"date": "2021-02-05", "text": "To determine whether it is legal to play a modal double-faced card, consider only the characteristics of the face you’re playing and ignore the other face’s characteristics."}, {"date": "2021-02-05", "text": "If an effect allows you to play a specific modal double-faced card, you may cast it as a spell or play it as a land, as determined by which face you choose to play. If an effect allows you to cast (rather than “play”) a specific modal double-faced card, you can’t play it as a land."}, {"date": "2021-02-05", "text": "If an effect allows you to play a land or cast a spell from among a group of cards, you may play or cast a modal double-faced card with any face that fits the criteria of that effect."}, {"date": "2021-02-05", "text": "The converted mana cost of a modal double-faced card is based on the characteristics of the face that’s being considered. On the stack and battlefield, consider whichever face is up. In all other zones, consider only the front face. This is different than how the converted mana cost of a transforming double-faced card is determined."}, {"date": "2021-02-05", "text": "A modal double-faced card can’t be transformed or be put onto the battlefield transformed. Ignore any instruction to transform a modal double-faced card or to put one onto the battlefield transformed."}, {"date": "2021-02-05", "text": "If an effect puts a double-faced card onto the battlefield, it enters with its front face up. If that front face can’t be put onto the battlefield, it doesn’t enter the battlefield."}, {"date": "2021-02-05", "text": "If an effect instructs a player to choose a card name, the name of either face may be chosen. If that effect or a linked ability refers to a spell with the chosen name being cast and/or a land with the chosen name being played, it considers only the chosen name, not the other face’s name."}, {"date": "2021-02-05", "text": "In the Commander variant, a double-faced card’s color identity is determined by the mana costs and mana symbols in the rules text of both faces combined. If either face has a color indicator or basic land type, those are also considered."}], "printings": ["KHM", "PKHM", "PRM"], "originalText": "Flying, vigilance\nSnow lands your opponents control enter the battlefield tapped.\nNoncreature spells your opponents cast with converted mana cost 4 or greater cost {2} more to cast.\n\n\nArtifact\n{3}{W}", "originalType": "Legendary Creature — God", "legalities": [{"format": "Alchemy", "legality": "Legal"}, {"format": "Brawl", "legality": "Legal"}, {"format": "Commander", "legality": "Legal"}, {"format": "Duel", "legality": "Legal"}, {"format": "Future", "legality": "Legal"}, {"format": "Gladiator", "legality": "Legal"}, {"format": "Historic", "legality": "Legal"}, {"format": "Historicbrawl", "legality": "Legal"}, {"format": "Legacy", "legality": "Legal"}, {"format": "Modern", "legality": "Legal"}, {"format": "Pioneer", "legality": "Legal"}, {"format": "Standard", "legality": "Legal"}, {"format": "Vintage", "legality": "Legal"}], "id": "f0c356e8-740c-5363-9fde-56f4902492ae"}